# Upload and Cleanning Process of Data (Income)

### Importing Libraries

In [28]:
# importing necesary libraries
import pandas as pd

## Income

### Uploading Raw Data for Income

In [29]:
# Reading the csv file
income_df = pd.read_csv('source/wages.csv') 
# Showing the raw dataframe to be cleanned
income_df.head()

,Metropolitan,Quarterly,July,August,September,Total,Average,September.1,Total.1
0,Statistical,Establishments,Employment,Employment,Employment,Quarterly,Weekly,Employment,Quarterly
1,Area (MSA),NaN,NaN,NaN,NaN,Wages,Wage,Location,Wages
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Quotient,Location
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Quotient
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Cleanning process of Data

In [30]:
# Extracting relevant columns 
income_df=income_df[["Metropolitan", "Quarterly","Total","Average"]]
# Removing first six rows
income_df=income_df.iloc[6:]
# Dropping rows with missing values 
income_df.dropna()
# Resetting index
income_df = income_df.reset_index(drop=True)
# Renaming columns
income_df= income_df.rename({"Average":"Avg Income", "Quarterly":"Quarterly Income",
                      "Total":"Total Income", "Metropolitan":"Metropolitan Areas"}, axis=1)
# Removing unwanted text
income_df["Metropolitan Areas"] = income_df["Metropolitan Areas"].apply(lambda x: x.replace(" MSA",""))
# Printing clean dataframe
income_df.head()

      Metropolitan Areas Quarterly Income   Total Income Avg Income
0            Abilene, TX            4,277    703,615,180        801
1  Aguadilla-Isabela, PR            3,648    304,855,671        455
2              Akron, OH           17,670  3,784,546,233        901
3             Albany, GA            3,300    598,604,319        771
4             Albany, OR            3,663    547,388,461        895

### Exporting data to csv file

In [31]:
# Export data
wage_pd.to_csv(r'output/wage_clean.csv')